gitpan/zxid/c/saml2-ns.c
/* c/saml2-ns.c - WARNING: This file was automatically generated. DO NOT EDIT!
 * $Id$ */
#include "c/saml2-ns.h"

struct zx_ns_s zx_ns_tab[] = {
{ 0, sizeof("sa")-1, "sa", sizeof("urn:oasis:names:tc:SAML:2.0:assertion")-1, "urn:oasis:names:tc:SAML:2.0:assertion"  },
{ 0, sizeof("sp")-1, "sp", sizeof("urn:oasis:names:tc:SAML:2.0:protocol")-1, "urn:oasis:names:tc:SAML:2.0:protocol"  },
{ 0, sizeof("ds")-1, "ds", sizeof("http://www.w3.org/2000/09/xmldsig#")-1, "http://www.w3.org/2000/09/xmldsig#"  },
{ 0, sizeof("xenc")-1, "xenc", sizeof("http://www.w3.org/2001/04/xmlenc#")-1, "http://www.w3.org/2001/04/xmlenc#"  },
{ 0, sizeof("se")-1, "se", sizeof("http://schemas.xmlsoap.org/soap/envelope/")-1, "http://schemas.xmlsoap.org/soap/envelope/"  },
{ 0, sizeof("sp11")-1, "sp11", sizeof("urn:oasis:names:tc:SAML:1.0:protocol")-1, "urn:oasis:names:tc:SAML:1.0:protocol"  },
{ 0, sizeof("sa11")-1, "sa11", sizeof("urn:oasis:names:tc:SAML:1.0:assertion")-1, "urn:oasis:names:tc:SAML:1.0:assertion"  },
{ 0, sizeof("ff12")-1, "ff12", sizeof("urn:liberty:iff:2003-08")-1, "urn:liberty:iff:2003-08"  },
{ 0, sizeof("ac")-1, "ac", sizeof("urn:liberty:ac:2004-12")-1, "urn:liberty:ac:2004-12"  },

  { 0,0,0,0,0 }  /* Trailer element serves at runtime to hold list of unrecognized namespaces. */
};

/* EOF */
